# ExportingAreas Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ACADExportOptions..::..ExportingAreas Property
ACADExportOptions Class See Also
---
True to export area and room geometry, false otherwise. Default value is false.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool ExportingAreas { get; set; }
```

Visual Basic
---
```text
Public Property ExportingAreas As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ExportingAreas {
	bool get ();
	void set (bool value);
}
```

# See Also
ACADExportOptions Class
Autodesk.Revit.DB Namespace